MrAMS/QueFOC/QueFOC_CH32V307/Hardware/nvic.c
/*
 * nvic.c
 *
 *  Created on: Dec 26, 2022
 *      Author: 24216
 */

#include "ch32v30x.h"
#include "hardware.h"

void hardware_nvic_boot(void){
    NVIC_InitTypeDef NVIC_InitStructure={0};

    // Only see preemption priority 0..15
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_4);

    // ADC_VBUS_DMA DMA_IT_TC       0
    NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; // useless
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // ADC          ADC_IT_JEOC     1
    NVIC_InitStructure.NVIC_IRQChannel = ADC1_2_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0; // useless
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // USART3       USART_IT_RXNE   2
    NVIC_InitStructure.NVIC_IRQChannel = USART3_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);


}
